html/org-pages/qc1/week17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-08 Wed 22:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 17 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 17 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 17 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga00badf">Week 17 - Superdense Coding</a>
<ul>
<li><a href="#orgd8dff09">Bell States</a></li>
<li><a href="#orgb9215bc">Setting up the protocol</a></li>
<li><a href="#org8093111">Introduction to Superdense Coding</a></li>
</ul>
</li>
<li><a href="#orgf2379bb">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga00badf" class="outline-2">
<h2 id="orga00badf">Week 17 - Superdense Coding</h2>
<div class="outline-text-2" id="text-orga00badf">
</div>
<div id="outline-container-orgd8dff09" class="outline-3">
<h3 id="orgd8dff09">Bell States</h3>
<div class="outline-text-3" id="text-orgd8dff09">
<ul class="org-ul">
<li>They are the most entangled states of a two-qubit circuits</li>
<li>Each Bell state has its own circuit</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9215bc" class="outline-3">
<h3 id="orgb9215bc">Setting up the protocol</h3>
<div class="outline-text-3" id="text-orgb9215bc">
<ol class="org-ol">
<li>Alice and Bob need to create and share the first Bell state (entangle two qubits)</li>
<li>Create a decision scheme which assigns a message to each Bell state.</li>
<li>The scheme usually is: 00 - \[|\beta00\rangle\], 01 - \[|\beta01\rangle\], 10 - \[|\beta10\rangle\], 11 - \[|\beta11\rangle\]</li>
</ol>
</div>
</div>

<div id="outline-container-org8093111" class="outline-3">
<h3 id="org8093111">Introduction to Superdense Coding</h3>
<div class="outline-text-3" id="text-org8093111">
<ul class="org-ul">
<li>It has 3 phases:
<ol class="org-ol">
<li>Sharing (The party entangles two qubits, each one taking one qubit)</li>
<li>Sending (Alice applies a circuit to her qubit to create a bell state between the entangled pair. Then, she sends her qubit to Bob)</li>
<li>Measuring (Bob measures his qubit, and can see which Bell state the qubits became. Then, he uses the decision scheme to dechiper the message)</li>
</ol></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf2379bb" class="outline-2">
<h2 id="orgf2379bb">Resources</h2>
<div class="outline-text-2" id="text-orgf2379bb">
<p>
Qiskit textbook page on superdense coding
URL: <a href="https://qiskit.org/textbook/ch-algorithms/superdense-coding.html">https://qiskit.org/textbook/ch-algorithms/superdense-coding.html</a>
</p>

<p>
Implementation of superdense coding
URL:<a href="https://www.osti.gov/pages/servlets/purl/1343530">https://www.osti.gov/pages/servlets/purl/1343530</a>
</p>

<p>
Sharing of entanglement over long distances
URL: <a href="https://physicsworld.com/a/entanglement-distributed-over-1200-km-by-quantum-satellite/">https://physicsworld.com/a/entanglement-distributed-over-1200-km-by-quantum-satellite/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-06-08 Wed 22:13</p>
</div>
</body>
</html>
